response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://tdci.com/BuyDesign/8.0/Configurator/WebService/" xmlns:tdci="http://schemas.datacontract.org/2004/07/TDCI.Configurator.ServiceContract">
    <soapenv:Header/>
    <soapenv:Body>
        <web:PrepareForInteractiveConfiguration>
            <web:inputParameters>
                <tdci:Application>
                    <tdci:Instance>BuyDesign</tdci:Instance>
                    <tdci:Name>BD1030097_Prod</tdci:Name>
                </tdci:Application>
                <tdci:HeaderDetail>
                    <tdci:DetailId>AC-PSC-5a31b7cb98509</tdci:DetailId>
                    <tdci:HeaderId>5a31b7af91504</tdci:HeaderId>
                </tdci:HeaderDetail>
                <tdci:IntegrationParameters>
                    <tdci:IntegrationParameter>
                        <tdci:IsNull>false</tdci:IsNull>
                        <tdci:Name>CurrencyCode</tdci:Name>
                        <tdci:SimpleValue>USD</tdci:SimpleValue>
                        <tdci:Type>String</tdci:Type>
                    </tdci:IntegrationParameter>
                    <tdci:IntegrationParameter>
                        <tdci:Name>BillTo</tdci:Name>
                        <tdci:SimpleValue>abc123</tdci:SimpleValue>
                    </tdci:IntegrationParameter>
                    <tdci:IntegrationParameter>
                        <tdci:Name>Quantity</tdci:Name>
                        <tdci:SimpleValue>1</tdci:SimpleValue>
                    </tdci:IntegrationParameter>
                </tdci:IntegrationParameters>
                <tdci:Mode>InteractiveRuleset</tdci:Mode>
                <tdci:Part>
                    <tdci:Name>AC</tdci:Name>
                    <tdci:Namespace>PSC</tdci:Namespace>
                </tdci:Part>
                <tdci:Profile>Default</tdci:Profile>
                <tdci:SourceHeaderDetail>
                    <tdci:DetailId>AC-PSC-5a31b7cb98509</tdci:DetailId>
                    <tdci:HeaderId>5a31b7af91504</tdci:HeaderId>
                </tdci:SourceHeaderDetail>
                <tdci:VariantKey></tdci:VariantKey>
            </web:inputParameters>
            <web:pageCaption>Test Config</web:pageCaption>
            <web:redirectUrl>http%3A%2F%2Fpanelshop.com%2Fwp-content%2Fplugins%2Fpanelshop-configurator%2Fhelper%2Ffinish.configuration.php%3FdetailIDheaderID%3DAC-PSC-5a31b7cb98509%7C5a31b7af91504%7C97%7CAC%7CPSC</web:redirectUrl>
        </web:PrepareForInteractiveConfiguration>
    </soapenv:Body>
</soapenv:Envelope>

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><PrepareForInteractiveConfigurationResponse xmlns="http://tdci.com/BuyDesign/8.0/Configurator/WebService/"><PrepareForInteractiveConfigurationResult>http://store.panelshop.com/BuyDesign/Configurator/Config.aspx?InstanceID=BuyDesign&amp;AppID=BD1030097_Prod&amp;HeaderID=5a693b4803414&amp;ConfigurationID=AC-PSC-5a69402dde51e&amp;PageTitle=Test%20Config&amp;RedirectUrl=http%253A%252F%252Fpanelshop.com%252Fwp-content%252Fplugins%252Fpanelshop-configurator%252Fhelper%252Ffinish.configuration.php%253FdetailIDheaderID%253DAC-PSC-5a69402dde51e%257C5a693b4803414%257C97%257CAC%257CPSC</PrepareForInteractiveConfigurationResult></PrepareForInteractiveConfigurationResponse></s:Body></s:Envelope>

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://tdci.com/BuyDesign/8.0/Configurator/WebService/" xmlns:tdci="http://schemas.datacontract.org/2004/07/TDCI.Configurator.ServiceContract">
<soapenv:Header/>
<soapenv:Body>
    <web:PrepareForInteractiveConfiguration>
        <web:inputParameters>
            <tdci:Application>
                <tdci:Instance>BuyDesign</tdci:Instance>
                <tdci:Name>BD1030097_Prod</tdci:Name>
            </tdci:Application>
            <tdci:HeaderDetail>
                <tdci:DetailId>AC-PSC-5a69402dde51e</tdci:DetailId>
                <tdci:HeaderId>5a693b4803414</tdci:HeaderId>
            </tdci:HeaderDetail>
            <tdci:IntegrationParameters>
                <tdci:IntegrationParameter>
                    <tdci:IsNull>false</tdci:IsNull>
                    <tdci:Name>CurrencyCode</tdci:Name>
                    <tdci:SimpleValue>USD</tdci:SimpleValue>
                    <tdci:Type>String</tdci:Type>
                </tdci:IntegrationParameter>
                <tdci:IntegrationParameter>
                    <tdci:Name>BillTo</tdci:Name>
                    <tdci:SimpleValue>abc123</tdci:SimpleValue>
                </tdci:IntegrationParameter>
                <tdci:IntegrationParameter>
                    <tdci:Name>Quantity</tdci:Name>
                    <tdci:SimpleValue>1</tdci:SimpleValue>
                </tdci:IntegrationParameter>
            </tdci:IntegrationParameters>
            <tdci:Mode>InteractiveRuleset</tdci:Mode>
            <tdci:Part>
                <tdci:Name>AC</tdci:Name>
                <tdci:Namespace>PSC</tdci:Namespace>
            </tdci:Part>
            <tdci:Profile>Default</tdci:Profile>
            <tdci:SourceHeaderDetail>
                <tdci:DetailId>AC-PSC-5a69402dde51e</tdci:DetailId>
                <tdci:HeaderId>5a693b4803414</tdci:HeaderId>
            </tdci:SourceHeaderDetail>
            <tdci:VariantKey></tdci:VariantKey>
        </web:inputParameters>
        <web:pageCaption>Test Config</web:pageCaption>
        <web:redirectUrl>http%3A%2F%2Fpanelshop.com%2Fwp-content%2Fplugins%2Fpanelshop-configurator%2Fhelper%2Ffinish.configuration.php%3FdetailIDheaderID%3DAC-PSC-5a69402dde51e%7C5a693b4803414%7C97%7CAC%7CPSC</web:redirectUrl>
    </web:PrepareForInteractiveConfiguration>
</soapenv:Body>
</soapenv:Envelope>

        <?xml version="1.0"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><FinishInteractiveConfigurationResponse xmlns="http://tdci.com/BuyDesign/8.0/Configurator/WebService/"><FinishInteractiveConfigurationResult xmlns:a="http://schemas.datacontract.org/2004/07/TDCI.Configurator.ServiceContract" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:CommitParameters><a:CommitParameter><a:IsNull>false</a:IsNull><a:Name>CfgDescription</a:Name><a:SimpleValue>ACACTA48001C01CB1BPXAAX&lt;BR&gt;&lt;b&gt;LENZE-AC TECH&lt;/b&gt;, SCF, 208/3/60, CT, 1HP/.75kW, &lt;BR&gt;N1, BYPASS, CB, ILR, DB, &lt;BR&gt;S/S,HOA,POT, 2PL, CPT&lt;BR&gt;&lt;BR&gt;&lt;BR&gt;Estimated Delivery: 6 - 8 weeks&amp;#8225;</a:SimpleValue><a:Type>String</a:Type><a:ValueElements i:nil="true"/></a:CommitParameter><a:CommitParameter><a:IsNull>false</a:IsNull><a:Name>ConfiguredPrice</a:Name><a:SimpleValue>2423.36</a:SimpleValue><a:Type>Number</a:Type><a:ValueElements i:nil="true"/></a:CommitParameter><a:CommitParameter><a:IsNull>false</a:IsNull><a:Name>CTRL_IMAGE</a:Name><a:SimpleValue>http://store.panelshop.com/BuyDesign/ConfiguratorContent/InfoLinks/AC/ACBXAA.PDF</a:SimpleValue><a:Type>String</a:Type><a:ValueElements i:nil="true"/></a:CommitParameter><a:CommitParameter><a:IsNull>false</a:IsNull><a:Name>ENC_IMAGE</a:Name><a:SimpleValue>http://store.panelshop.com/BuyDesign/ConfiguratorContent/InfoLinks/ENC/ENC01CP01A.PDF</a:SimpleValue><a:Type>String</a:Type><a:ValueElements i:nil="true"/></a:CommitParameter><a:CommitParameter><a:IsNull>false</a:IsNull><a:Name>GEN_IMAGE</a:Name><a:SimpleValue>http://store.panelshop.com/BuyDesign/ConfiguratorContent/InfoLinks/AC/AC3PBXIC.PDF</a:SimpleValue><a:Type>String</a:Type><a:ValueElements i:nil="true"/></a:CommitParameter><a:CommitParameter><a:IsNull>false</a:IsNull><a:Name>WEIGHT</a:Name><a:SimpleValue>119.3</a:SimpleValue><a:Type>Number</a:Type><a:ValueElements i:nil="true"/></a:CommitParameter><a:CommitParameter><a:IsNull>false</a:IsNull><a:Name>ImageLink</a:Name><a:SimpleValue>http://store.panelshop.com/BuyDesign/ConfiguratorContent/IMAGES/panelshop1.png</a:SimpleValue><a:Type>String</a:Type><a:ValueElements i:nil="true"/></a:CommitParameter><a:CommitParameter><a:IsNull>false</a:IsNull><a:Name>ImagePath</a:Name><a:SimpleValue>file:///c:/inetpub/wwwroot/BuyDesign/ConfiguratorContent/IMAGES/panelshop1.png</a:SimpleValue><a:Type>String</a:Type><a:ValueElements i:nil="true"/></a:CommitParameter></a:CommitParameters><a:Content xmlns:b="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/><a:DetailId>AC-PSC-5a69434584e09</a:DetailId><a:HeaderId>5a693b4803414</a:HeaderId><a:InputParameters><a:Application><a:Instance>BuyDesign</a:Instance><a:Name>BD1030097_Prod</a:Name></a:Application><a:HeaderDetail><a:DetailId>AC-PSC-5a69434584e09</a:DetailId><a:HeaderId>5a693b4803414</a:HeaderId></a:HeaderDetail><a:IntegrationParameters><a:IntegrationParameter><a:IsNull>false</a:IsNull><a:Name>CurrencyCode</a:Name><a:SimpleValue>USD</a:SimpleValue><a:Type>String</a:Type></a:IntegrationParameter><a:IntegrationParameter><a:IsNull>false</a:IsNull><a:Name>BillTo</a:Name><a:SimpleValue>abc123</a:SimpleValue><a:Type>String</a:Type></a:IntegrationParameter><a:IntegrationParameter><a:IsNull>false</a:IsNull><a:Name>Quantity</a:Name><a:SimpleValue>1</a:SimpleValue><a:Type>String</a:Type></a:IntegrationParameter><a:IntegrationParameter><a:IsNull>false</a:IsNull><a:Name>VariantKey</a:Name><a:SimpleValue/><a:Type>String</a:Type></a:IntegrationParameter><a:IntegrationParameter><a:IsNull>false</a:IsNull><a:Name>ExchangeRate</a:Name><a:SimpleValue>1</a:SimpleValue><a:Type>Number</a:Type></a:IntegrationParameter></a:IntegrationParameters><a:Mode>InteractiveRuleset</a:Mode><a:Part><a:Name>AC</a:Name><a:Namespace>PSC</a:Namespace></a:Part><a:Profile>Default</a:Profile><a:RapidOptions/><a:SourceHeaderDetail><a:DetailId>AC-PSC-5a69434584e09</a:DetailId><a:HeaderId>5a693b4803414</a:HeaderId></a:SourceHeaderDetail><a:VariantKey i:nil="true"/></a:InputParameters><a:Message/><a:OrderDetails><a:Detail><a:DataType>String</a:DataType><a:Description/><a:DetailSequence>0</a:DetailSequence><a:PrintCode/><a:PrintSequence>0</a:PrintSequence><a:SimpleValue/><a:Type>Order</a:Type></a:Detail></a:OrderDetails><a:PricingDetails/><a:Result>Success</a:Result><a:SummaryDetails/><a:VariantKey i:nil="true"/></FinishInteractiveConfigurationResult></FinishInteractiveConfigurationResponse></s:Body></s:Envelope>
